# author:zhujianhua
# contact: 99376627@qq.com
# datetime:2020/12/16 16:51
# software: PyCharm
role=['显示信息一致性的原则，','以用户为主导原则，','易用性原则，','鼠标与键盘一致性原则，','系统响应时间原则，','出错信息和警告原则，','信息显示原则，','数据输入原则，','合理性原则，',
            '美观与协调性原则，','显示信息一致性的原则，','以用户为主导原则， ','易用性原则，','鼠标与键盘一致性原则，','系统响应时间原则，','出错信息和警告原则，',
            '信息显示原则，','数据输入原则，','合理性原则，','美观与协调性原则，','只读的文本框和可输入的文本框在颜色上必须区分；','文本框上下或者左右对齐；',' 数字靠右显示；','字数相等的文字居中显示；','字数不等的文字靠左显示；','新增的记录必须排在首页首行。',
            '提交失败后必须保存用户已经输入的内容，以便再次提交。','提交时需对主要标识字段进行重复值、空值（空格）判断。','新增内容提交失败后，须保留用户修改的内容，以便再次修改提交；需对主标识字段进行重复值、空值（空格）判断',
            '如界面存在复选按钮，勾选多条记录进行修改时，每次只能对一条记录进行修改，默认修改内容为第一条的提示信息；','必须有确认删除的提示信息；','每次查询后定位到原页面；','在数据量较多的页面中，当进行了修改后，取消请给予提示','当保存所费的时间较长时，需给出保存进度界面的提示；','须控制不可以重复保存',
            '必须保证重置后与初始进入此页面时一致性；','当从一个页面点击按钮或链接进入子页面时，子页面必须提供返回按钮；','勾选全选，则选中当前页面所有记录','打开一个新界面，光标默认停留在第一个待输入的文本框中；','表单元素选择要求主要集中在','表单元素选择要求主要集中在：','当父窗体与子窗体都存在同样的查询条件时，父窗体已输入的查询条件必须被带到子窗体中；',
            '关闭父窗体必须连同子窗体一同关闭；','只允许输入数字的输入框需要控制其它字符的输入，或在输入非法值时给予提示，或在输入框内不再捕获非法值；','帮助文档中的性能介绍与说明要与系统性能配套一致；','更新系统版本时，对作了修改的地方在帮助文档中要做相应的修改；','操作时要提供及时调用帮助的快捷方式，常用F1；','在界面上即时调用帮助时，应该能够及时定位到与该操作相对应的帮助位置，也就是说帮助要有即时的针对性；','最好提供目前流行的联机帮助格式或HTML帮助格式；','用户可以用关键词在帮助索引中搜索所要的帮助，当然也应该提供帮助索引；','如果没有提供软件书面的帮助文档，最好能够有打印帮助的功能；','在帮助中应该提供我们的技术支持方式，一旦用户难以自己解决可以方便的寻求新的帮助方式；',
            '菜单通常采用“常用--主要--次要--工具--帮助”的位置排列，符合Windows风格的要求；',
            '常用的有“文件”、“编辑”，“查看”等，需要系统有这些选项；',
            '下拉菜单要根据菜单选项的含义进行分组，并切按照一定的规则进行排列，用横线隔开；',
            '一组菜单的使用有先后要求或有向导作用时，应该按先后次序排列；',
            '没有顺序要求的菜单项按使用频率和重要性排列，常用的放在开头， 不常用的靠后放置；重要的放在开头，次要的放在后边；如果菜单选项较多，应该采用加长菜单的长度而减少深度',
            '菜单深度一般要求最多控制在三层以内；',
            '最好能够对和正在进行的操作无关的菜单项能够屏蔽，也可采用动态加载方式——即只有需要的菜单才显示；',
            '菜单前的图标不宜太大，与和相应的字高保持一致；',

      ]